Manuvr/Digitabulum-Firmware/src/Digitabulum/CPLDDriver/target_stm32f746.cpp
/*
File:   target_stm32f746.cpp
Author: J. Ian Lindsay
Date:   2016.12.04

Copyright 2016 Manuvr, Inc

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.


These are platform-specific functions for dealing with Digitabulum's sensor
  package.
This file contains functions for running firmware on hardware revision 1.
*/

extern "C" {
  #include <stm32f7xx_hal_dma.h>
  #include <stm32f7xx_hal_tim.h>
  #include <stm32f7xx_hal_def.h>
  #include <stm32f7xx_hal_gpio.h>
  #include <stm32f7xx_hal_spi.h>
  #include <stm32f7xx_hal.h>

  TIM_HandleTypeDef htim1;
  SPI_HandleTypeDef hspi1;
  SPI_HandleTypeDef hspi2;
  DMA_HandleTypeDef _spi2_dma;
  DMA_HandleTypeDef _dma_r;  // SPI1
  DMA_HandleTypeDef _dma_w;  // SPI1

  /*
  * Notated like a const, but should NOT be a const, because we use this as a DMA read sink as well
  *   as a sort of /dev/zero. This never contains any meaningful data.
  */
  static uint32_t STATIC_ZERO = 0;
  static uint32_t STATIC_SINK = 0;
}

/*
* The HAL library does not break this out, and it doesn't support double-buffer.
* Replicated definition from stm32f7xx_hal_dma.c
*/
typedef struct {
  __IO uint32_t ISR;       /*!< DMA interrupt status register */
  __IO uint32_t Reserved0;
  __IO uint32_t IFCR;      /*!< DMA interrupt flag clear register */
} DMA_Base_Registers;


/**
* Used to disable the DMA IRQs at the NVIC.
*
* @param bool enable the interrupts?
*/
void enableSPI_DMA(bool enable) {
  if (enable) {
    NVIC_EnableIRQ(DMA2_Stream2_IRQn);  // Allow read IRQ.
    //NVIC_EnableIRQ(DMA2_Stream3_IRQn);
  }
  else {
    NVIC_DisableIRQ(DMA2_Stream2_IRQn);  // Inhibit read IRQ.
    NVIC_DisableIRQ(DMA2_Stream3_IRQn);
  }
}


/**
* Should undo all the effects of the init functions.
*/
void CPLDDriver::_deinit() {
  //HAL_GPIO_DeInit(GPIOA, GPIO_PIN_4|GPIO_PIN_6|GPIO_PIN_5|GPIO_PIN_7);
  //HAL_GPIO_DeInit(GPIOB, GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15);

  //__TIM1_CLK_DISABLE();
  //HAL_GPIO_DeInit(GPIOA, GPIO_PIN_8);

  //HAL_SPI_DeInit(&hspi1);
  //HAL_SPI_DeInit(&hspi2);
  //__HAL_RCC_SPI1_CLK_DISABLE();
  //__HAL_RCC_SPI2_CLK_DISABLE();
}


/**
* Init the timer to provide the CPLD with an external clock. This clock is the
*   most-flexible, and we use it by default.
*/
bool CPLDDriver::_set_timer_base(uint16_t _period) {
  htim1.Instance               = TIM1;
  htim1.Init.Prescaler         = 0;
  htim1.Init.CounterMode       = TIM_COUNTERMODE_UP;
  htim1.Init.Period            = _period;
  htim1.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
  htim1.Init.RepetitionCounter = 0;  // TODO: Move this to 8 to reduce power?
  return (HAL_OK == HAL_TIM_Base_Init(&htim1));
}


/**
* Init the timer to provide the CPLD with an external clock. This clock is the
*   most-flexible, and we use it by default.
*/
void CPLDDriver::init_ext_clk() {
  __TIM1_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct;

  /* These Port A pins are outputs at the discretion of the timer:
  *
  * #  Default   Purpose
  * -----------------------------------------------
  * 8     1      CPLD_EXT_CLK
  */
  GPIO_InitStruct.Pin        = GPIO_PIN_8;
  GPIO_InitStruct.Mode       = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull       = GPIO_NOPULL;
  GPIO_InitStruct.Speed      = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate  = GPIO_AF1_TIM1;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  _set_timer_base(0xFFF0);  // Make the clock real slow until we need it.

  TIM_ClockConfigTypeDef sClockSourceConfig;
  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  HAL_TIM_ConfigClockSource(&htim1, &sClockSourceConfig);
  HAL_TIM_OC_Init(&htim1);

  TIM_MasterConfigTypeDef sMasterConfig;
  sMasterConfig.MasterOutputTrigger  = TIM_TRGO_RESET;
  sMasterConfig.MasterOutputTrigger2 = TIM_TRGO2_RESET;
  sMasterConfig.MasterSlaveMode      = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(&htim1, &sMasterConfig);

  TIM_BreakDeadTimeConfigTypeDef sBreakDeadTimeConfig;
  sBreakDeadTimeConfig.OffStateRunMode  = TIM_OSSR_DISABLE;
  sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_DISABLE;
  sBreakDeadTimeConfig.LockLevel        = TIM_LOCKLEVEL_OFF;
  sBreakDeadTimeConfig.DeadTime         = 0;
  sBreakDeadTimeConfig.BreakState       = TIM_BREAK_DISABLE;
  sBreakDeadTimeConfig.BreakPolarity    = TIM_BREAKPOLARITY_HIGH;
  sBreakDeadTimeConfig.BreakFilter      = 0;
  sBreakDeadTimeConfig.Break2State      = TIM_BREAK2_DISABLE;
  sBreakDeadTimeConfig.Break2Polarity   = TIM_BREAK2POLARITY_HIGH;
  sBreakDeadTimeConfig.Break2Filter     = 0;
  sBreakDeadTimeConfig.AutomaticOutput  = TIM_AUTOMATICOUTPUT_DISABLE;
  HAL_TIMEx_ConfigBreakDeadTime(&htim1, &sBreakDeadTimeConfig);

  TIM_OC_InitTypeDef sConfigOC;
  sConfigOC.OCMode       = TIM_OCMODE_TOGGLE;
  sConfigOC.Pulse        = 0;
  sConfigOC.OCPolarity   = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
  sConfigOC.OCFastMode   = TIM_OCFAST_DISABLE;
  sConfigOC.OCIdleState  = TIM_OCIDLESTATE_SET;
  sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_SET;
  HAL_TIM_OC_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1);
}


/**
* Init of SPI peripheral 1. This is broken out because we might be bringing it
*   up and down in a single runtime for debug reasons.
*
* @param  cpol  Clock polartiy
* @param  cpha  Clock phase
*/
void CPLDDriver::init_spi(uint8_t cpol, uint8_t cpha) {
  GPIO_InitTypeDef GPIO_InitStruct;
  uint8_t cpol_mode = (cpol) ? SPI_POLARITY_HIGH : SPI_POLARITY_LOW;
  uint8_t cpha_mode = (cpha) ? SPI_PHASE_2EDGE : SPI_PHASE_1EDGE;

  HAL_NVIC_DisableIRQ(SPI1_IRQn);

  if (_er_flag(CPLD_FLAG_SPI1_READY)) {
    _er_clear_flag(CPLD_FLAG_SPI1_READY);
    __HAL_SPI_DISABLE(&hspi1);
  }
  else {
    __HAL_RCC_SPI1_CLK_ENABLE();
    __HAL_RCC_DMA2_CLK_ENABLE();
  }

  /* These Port A pins are associated with the SPI1 peripheral:
  *
  * #  Default   Purpose
  * -----------------------------------------------
  * 4   SPI1_CS
  * 5   SPI1_CLK
  * 6   SPI1_MISO
  * 7   SPI1_MOSI
  */
  GPIO_InitStruct.Pin       = GPIO_PIN_6|GPIO_PIN_5|GPIO_PIN_7;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  GPIO_InitStruct.Pin  = GPIO_PIN_4;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  //setPinEvent(3, uint8_t condition, cpld_xfer_complete);

  _dma_r.Instance                  = DMA2_Stream2;
  _dma_r.Init.Channel              = DMA_CHANNEL_3;
  _dma_r.Init.Direction            = DMA_PERIPH_TO_MEMORY;   // Receive
  _dma_r.Init.PeriphInc            = DMA_PINC_DISABLE;
  _dma_r.Init.MemInc               = DMA_MINC_ENABLE;
  _dma_r.Init.PeriphDataAlignment  = DMA_PDATAALIGN_BYTE;
  _dma_r.Init.MemDataAlignment     = DMA_MDATAALIGN_BYTE;
  _dma_r.Init.Mode                 = DMA_NORMAL;
  _dma_r.Init.Priority             = DMA_PRIORITY_LOW;
  _dma_r.Init.FIFOMode             = DMA_FIFOMODE_DISABLE;  // Required for differnt access-widths.
  _dma_r.Init.FIFOThreshold        = DMA_FIFO_THRESHOLD_FULL;
  _dma_r.Init.MemBurst             = DMA_MBURST_SINGLE;
  _dma_r.Init.PeriphBurst          = DMA_PBURST_SINGLE;
  HAL_DMA_Init(&_dma_r);
  HAL_NVIC_EnableIRQ(DMA2_Stream2_IRQn);

  _dma_w.Instance                 = DMA2_Stream3;
  _dma_w.Init.Channel             = DMA_CHANNEL_3;
  _dma_w.Init.Direction           = DMA_MEMORY_TO_PERIPH;   // Transmit
  _dma_w.Init.PeriphInc           = DMA_PINC_DISABLE;
  _dma_w.Init.MemInc              = DMA_MINC_ENABLE;
  _dma_w.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  _dma_w.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  _dma_w.Init.Mode                = DMA_NORMAL;
  _dma_w.Init.Priority            = DMA_PRIORITY_HIGH;
  _dma_w.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;  // Required for differnt access-widths.
  _dma_w.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  _dma_w.Init.MemBurst            = DMA_MBURST_SINGLE;
  _dma_w.Init.PeriphBurst         = DMA_PBURST_SINGLE;
  HAL_DMA_Init(&_dma_w);

  hspi1.Instance            = SPI1;
  hspi1.hdmarx              = &_dma_r;
  hspi1.hdmatx              = &_dma_w;
  hspi1.Init.Mode           = SPI_MODE_SLAVE;
  hspi1.Init.Direction      = SPI_DIRECTION_2LINES;
  hspi1.Init.NSS            = SPI_NSS_HARD_INPUT;
  hspi1.Init.DataSize       = SPI_DATASIZE_8BIT;
  hspi1.Init.CLKPolarity    = cpol_mode;
  hspi1.Init.CLKPhase       = cpha_mode;
  hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
  hspi1.Init.FirstBit       = SPI_FIRSTBIT_MSB;
  hspi1.Init.TIMode         = SPI_TIMODE_DISABLED;
  hspi1.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLED;
  hspi1.Init.CRCPolynomial  = 7;
  hspi1.Init.CRCLength      = SPI_CRC_LENGTH_DATASIZE;
  hspi1.Init.NSSPMode       = SPI_NSS_PULSE_DISABLED;
  _er_set_flag(CPLD_FLAG_SPI1_READY, (HAL_OK == HAL_SPI_Init(&hspi1)));

