Manuvr/Digitabulum-Firmware/src/Digitabulum/CPLDDriver/target_stm32f746.cpp
  HAL_NVIC_EnableIRQ(SPI1_IRQn);
}


/**
* Init of SPI peripheral 1. This is broken out because we might be bringing it
*   up and down in a single runtime for debug reasons.
*
* @param  cpol  Clock polartiy
* @param  cpha  Clock phase
*/
void CPLDDriver::init_spi2(uint8_t cpol, uint8_t cpha) {
  GPIO_InitTypeDef GPIO_InitStruct;
  uint8_t cpol_mode = (cpol) ? SPI_POLARITY_HIGH : SPI_POLARITY_LOW;
  uint8_t cpha_mode = (cpha) ? SPI_PHASE_2EDGE : SPI_PHASE_1EDGE;

  HAL_NVIC_DisableIRQ(DMA1_Stream3_IRQn);

  if (_er_flag(CPLD_FLAG_SPI2_READY)) {
    _er_clear_flag(CPLD_FLAG_SPI2_READY);
  }
  else {
    __HAL_RCC_SPI2_CLK_ENABLE();
    __HAL_RCC_DMA1_CLK_ENABLE();
  }

  /* These Port B pins are associated with the SPI2 peripheral:
  *
  * #  Default   Purpose
  * -----------------------------------------------
  * 12  SPI2_CS
  * 13  SPI2_CLK
  * 15  SPI2_MOSI
  */
  GPIO_InitStruct.Pin       = GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_15;
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  hspi2.Instance            = SPI2;
  hspi2.Init.Mode           = SPI_MODE_SLAVE;
  hspi2.Init.Direction      = SPI_DIRECTION_2LINES_RXONLY;
  hspi2.Init.NSS            = SPI_NSS_HARD_INPUT;
  hspi2.Init.DataSize       = SPI_DATASIZE_8BIT;  // TODO: Is this OK with half-word DMA?
  hspi2.Init.CLKPolarity    = cpol_mode;
  hspi2.Init.CLKPhase       = cpha_mode;
  hspi2.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_2;
  hspi2.Init.FirstBit       = SPI_FIRSTBIT_MSB;
  hspi2.Init.TIMode         = SPI_TIMODE_DISABLED;
  hspi2.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLED;
  hspi2.Init.CRCPolynomial  = 7;
  hspi2.Init.CRCLength      = SPI_CRC_LENGTH_DATASIZE;
  hspi2.Init.NSSPMode       = SPI_NSS_PULSE_DISABLED;
  _er_set_flag(CPLD_FLAG_SPI2_READY, (HAL_OK == HAL_SPI_Init(&hspi2)));

  SPI2->CR2 &= ~(SPI_CR2_LDMARX);  // Even byte count, always.
  SPI2->CR1 |= SPI_CR1_SPE;

  // We handle SPI2 in this class. Setup the DMA members.
  _spi2_dma.Instance                 = DMA1_Stream3;
  _spi2_dma.Init.Channel             = DMA_CHANNEL_0;
  _spi2_dma.Init.Direction           = DMA_PERIPH_TO_MEMORY;   // Receive
  _spi2_dma.Init.PeriphInc           = DMA_PINC_DISABLE;
  _spi2_dma.Init.MemInc              = DMA_MINC_ENABLE;
  _spi2_dma.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  _spi2_dma.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  _spi2_dma.Init.Mode                = DMA_CIRCULAR;
  _spi2_dma.Init.Priority            = DMA_PRIORITY_LOW;
  _spi2_dma.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;  // Required for differnt access-widths.
  _spi2_dma.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  _spi2_dma.Init.MemBurst            = DMA_MBURST_SINGLE;
  _spi2_dma.Init.PeriphBurst         = DMA_PBURST_SINGLE;
  HAL_DMA_Init(&_spi2_dma);
  HAL_NVIC_EnableIRQ(DMA1_Stream3_IRQn);

  /* Configure DMA for the IRQ aggregator. */
  _spi2_dma.State = HAL_DMA_STATE_BUSY;
  __HAL_DMA_DISABLE(&_spi2_dma);
  DMA1_Stream3->NDTR  = 10;
  DMA1_Stream3->PAR   = (uint32_t)&SPI2->DR;
  DMA1_Stream3->M0AR  = (uint32_t)_irq_data_1;
  DMA1_Stream3->M1AR  = (uint32_t)_irq_data_0;
  DMA1_Stream3->CR  |= (uint32_t) (DMA_SxCR_DBM | DMA_SxCR_CT);
  DMA1_Stream3->CR  |= (uint32_t) (DMA_IT_TC | DMA_IT_TE | DMA_IT_DME);
  DMA1_Stream3->FCR |= (uint32_t) DMA_IT_FE;
  __HAL_DMA_ENABLE(&_spi2_dma);

  SPI2->CR2 |= SPI_CR2_RXDMAEN;   // Let'ir rip. Should now manage itself.
}



extern "C" {
  /**
  * DMA ISR. This DMA stream is responsible for..
  * 1) signaling the software that the IRQ aggregator have delivered us a new
  *      set of signals.
  * 2) Maintaining the buffer index so that software reads the correct buffer.
  */
  void DMA1_Stream3_IRQHandler() {
    DMA_Base_Registers* regs = (DMA_Base_Registers*)_spi2_dma.StreamBaseAddress;
    int streamIndex = _spi2_dma.StreamIndex;

    /* Transfer Error Interrupt management */
    if ((regs->ISR & (DMA_FLAG_TEIF0_4 << streamIndex)) != RESET) {
      if(__HAL_DMA_GET_IT_SOURCE(&_spi2_dma, DMA_IT_TE) != RESET) {
        /* Disable the transfer error interrupt */
        __HAL_DMA_DISABLE_IT(&_spi2_dma, DMA_IT_TE);
        /* Clear the transfer error flag */
        regs->IFCR = DMA_FLAG_TEIF0_4 << streamIndex;
        /* Update error code */
        _spi2_dma.ErrorCode |= HAL_DMA_ERROR_TE;
        /* Change the DMA state */
        _spi2_dma.State = HAL_DMA_STATE_ERROR;
        Kernel::log("DMA1_Stream3 Error (Transfer)\n");
      }
    }
    /* FIFO Error Interrupt management */
    if ((regs->ISR & (DMA_FLAG_FEIF0_4 << streamIndex)) != RESET) {
      if(__HAL_DMA_GET_IT_SOURCE(&_spi2_dma, DMA_IT_FE) != RESET) {
        /* Disable the FIFO Error interrupt */
        __HAL_DMA_DISABLE_IT(&_spi2_dma, DMA_IT_FE);
        /* Clear the FIFO error flag */
        regs->IFCR = DMA_FLAG_FEIF0_4 << streamIndex;
        /* Update error code */
        _spi2_dma.ErrorCode |= HAL_DMA_ERROR_FE;
        /* Change the DMA state */
        _spi2_dma.State = HAL_DMA_STATE_ERROR;
        Kernel::log("DMA1_Stream3 Error (FIFO)\n");
      }
    }
    /* Transfer Complete Interrupt management */
    if ((regs->ISR & (DMA_FLAG_TCIF0_4 << streamIndex)) != RESET) {
      if(__HAL_DMA_GET_IT_SOURCE(&_spi2_dma, DMA_IT_TC) != RESET) {
        /* Clear the transfer complete flag */
        regs->IFCR = DMA_FLAG_TCIF0_4 << streamIndex;
      }

      /* Update error code */
      _spi2_dma.ErrorCode |= HAL_DMA_ERROR_NONE;

      if((DMA1_Stream3->CR & (uint32_t)(DMA_SxCR_DBM)) != 0) {
        uint8_t* completed_buf;
        uint8_t* previous_buf;
        if((DMA1_Stream3->CR & DMA_SxCR_CT) == 0) {
          _irq_data_ptr = (uint8_t*) _irq_data_1;  // The consumer of this buffer should start here.
          completed_buf = (uint8_t*) _irq_data_0;
          previous_buf  = (uint8_t*) _irq_data_1;
          //Kernel::log("DMA1_Stream3 Circular Bank 0\n");
          _spi2_dma.State = HAL_DMA_STATE_READY_MEM0;
        }
        else {
          _irq_data_ptr = (uint8_t*) _irq_data_0;  // The consumer of this buffer should start here.
          completed_buf = (uint8_t*) _irq_data_1;
          previous_buf  = (uint8_t*) _irq_data_0;
          //Kernel::log("DMA1_Stream3 Circular Bank 1\n");
          _spi2_dma.State = HAL_DMA_STATE_READY_MEM1;
        }

        *(uint32_t*)(_irq_diff + 0) = *(uint32_t*)(previous_buf + 0) ^ *(uint32_t*)(completed_buf + 0);
        *(uint32_t*)(_irq_diff + 4) = *(uint32_t*)(previous_buf + 4) ^ *(uint32_t*)(completed_buf + 4);
        *(uint16_t*)(_irq_diff + 8) = *(uint16_t*)(previous_buf + 8) ^ *(uint16_t*)(completed_buf + 8);
      }
      else {
        ///* Change the DMA state */
        //_spi2_dma.State = HAL_DMA_STATE_READY_MEM0;
        //__HAL_DMA_DISABLE(&_spi2_dma);
        //if (_irq_data_ptr == _irq_data_0) {
        //  _irq_data_ptr = _irq_data_1;  // The consumer of this buffer should start here.
        //  DMA1_Stream3->M0AR  = (uint32_t)_irq_data_0;
        //  Kernel::log("DMA1_Stream3 Bank 0\n");
        //}
        //else {
        //  _irq_data_ptr = _irq_data_0;  // The consumer of this buffer should start here.
        //  DMA1_Stream3->M0AR  = (uint32_t)_irq_data_1;
        //  Kernel::log("DMA1_Stream3 Bank 1\n");
        //}
        //DMA1_Stream3->CR   &= (uint32_t)(~DMA_SxCR_DBM);
        //DMA1_Stream3->PAR   = (uint32_t)&SPI2->DR;
        //DMA1_Stream3->NDTR  = 10;
        //DMA1_Stream3->CR  |= DMA_IT_TC | DMA_IT_TE | DMA_IT_DME;
        //DMA1_Stream3->FCR |= DMA_IT_FE;
        //__HAL_DMA_ENABLE(&_spi2_dma);
      }
      Kernel::isrRaiseEvent(&_irq_data_arrival);
    }
  }

