Manuvr/Digitabulum-Firmware/src/Digitabulum/CPLDDriver/target_stm32f746.cpp
  /*
  * SPI1 ISR.
  * TODO: Take full responsibility for this ISR. Do not rely on HAL driver.
  */
  void SPI1_IRQHandler() {
    HAL_SPI_IRQHandler(&hspi1);
  }


  void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi){
    Kernel::log("##### HAL_SPI_TxCpltCallback\n");
    if (hspi == &hspi1) {
      SPIBusOp* c = ((CPLDDriver*) cpld)->currentJob();
      if (c) {
        c->advance_operation(hspi->Instance->SR, hspi->Instance->DR);
      }
      else {
        Kernel::log("##### c==null device in HAL_SPI_TxCpltCallback\n");
      }
    }
    else {
      Kernel::log("##### Bad SPI device in HAL_SPI_TxCpltCallback\n");
    }
  }


  void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi){
    Kernel::log("##### HAL_SPI_TxRxCpltCallback\n");
    if (hspi == &hspi1) {
      SPIBusOp* c = ((CPLDDriver*) cpld)->currentJob();
      if (c) {
        c->advance_operation(hspi->Instance->SR, hspi->Instance->DR);
      }
      else {
        Kernel::log("##### c==null device in TxRxISR\n");
      }
    }
    else {
      Kernel::log("##### Bad SPI device in TxRxISR\n");
    }
  }


  void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi){
    Kernel::log("##### HAL_SPI_RxCpltCallback\n");
    if (hspi == &hspi1) {
      SPIBusOp* c = ((CPLDDriver*) cpld)->currentJob();
      if (c) {
        c->advance_operation(hspi->Instance->SR, hspi->Instance->DR);
      }
      else {
        Kernel::log("##### c==null device in DMARx\n");
      }
    }
    else {
      Kernel::log("##### Bad SPI device in DMARx\n");
    }
  }


  void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi){
    Kernel::log("##### HAL_SPI_ErrorCallback\n");
    if (hspi == &hspi1) {
      SPIBusOp* c = ((CPLDDriver*) cpld)->currentJob();
      if (c) {
        c->abort(XferFault::BUS_FAULT);
      }
    }
  }


  /**
  * DMA ISR. Rx
  */
  void DMA2_Stream2_IRQHandler() {
    //Kernel::log("DMA2_Stream2_IRQHandler()\n");
    ////HAL_SPI_IRQHandler(&hspi1);
    //DMA_Base_Registers* regs = (DMA_Base_Registers*)_dma_r.StreamBaseAddress;
    //int streamIndex = _dma_r.StreamIndex;
    ///* Transfer Error Interrupt management */
    //if ((regs->ISR & (DMA_FLAG_TEIF0_4 << streamIndex)) != RESET) {
    //  if(__HAL_DMA_GET_IT_SOURCE(&_dma_r, DMA_IT_TE) != RESET) {
    //    /* Disable the transfer error interrupt */
    //    __HAL_DMA_DISABLE_IT(&_dma_r, DMA_IT_TE);
    //    /* Clear the transfer error flag */
    //    regs->IFCR = DMA_FLAG_TEIF0_4 << streamIndex;
    //    /* Update error code */
    //    _dma_r.ErrorCode |= HAL_DMA_ERROR_TE;
    //    /* Change the DMA state */
    //    _dma_r.State = HAL_DMA_STATE_ERROR;
    //    Kernel::log("DMA2_Stream2 Error (Transfer)\n");
    //  }
    //}
    ///* FIFO Error Interrupt management */
    //if ((regs->ISR & (DMA_FLAG_FEIF0_4 << streamIndex)) != RESET) {
    //  if(__HAL_DMA_GET_IT_SOURCE(&_dma_r, DMA_IT_FE) != RESET) {
    //    /* Disable the FIFO Error interrupt */
    //    __HAL_DMA_DISABLE_IT(&_dma_r, DMA_IT_FE);
    //    /* Clear the FIFO error flag */
    //    regs->IFCR = DMA_FLAG_FEIF0_4 << streamIndex;
    //    /* Update error code */
    //    _dma_r.ErrorCode |= HAL_DMA_ERROR_FE;
    //    /* Change the DMA state */
    //    _dma_r.State = HAL_DMA_STATE_ERROR;
    //    Kernel::log("DMA2_Stream2 Error (FIFO)\n");
    //  }
    //}
    ///* Transfer Complete Interrupt management */
    //if ((regs->ISR & (DMA_FLAG_TCIF0_4 << streamIndex)) != RESET) {
    //  Kernel::log("DMA2_Stream2 TC\n");
    //  if(__HAL_DMA_GET_IT_SOURCE(&_dma_r, DMA_IT_TC) != RESET) {
    //    /* Clear the transfer complete flag */
    //    regs->IFCR = DMA_FLAG_TCIF0_4 << streamIndex;
    //  }
    //  /* Update error code */
    //  _dma_r.ErrorCode |= HAL_DMA_ERROR_NONE;
    //  /* Change the DMA state */
    //  _dma_r.State = HAL_DMA_STATE_READY_MEM0;
    //  __HAL_DMA_DISABLE(&_dma_r);
    //  SPIBusOp* c = ((CPLDDriver*) cpld)->currentJob();
    //  if (c) {
    //    c->advance_operation(0, 0);
    //  }
    //}
    //__HAL_DMA_DISABLE(&_dma_r);
    HAL_DMA_IRQHandler(&_dma_r);
  }


  /*
  * DMA ISR. Tx
  */
  void DMA2_Stream3_IRQHandler() {
    Kernel::log("DMA2_Stream3_IRQHandler()\n");
    __HAL_DMA_DISABLE_IT(&_dma_r, (DMA_IT_TC | DMA_IT_HT | DMA_IT_TE | DMA_IT_DME | DMA_IT_FE));
    __HAL_DMA_DISABLE_IT(&_dma_w, (DMA_IT_TC | DMA_IT_HT | DMA_IT_TE | DMA_IT_DME | DMA_IT_FE));
  }
}  // extern "C"


/**
* Pass 'true' to enable the CPLD osciallator. False to disable it.
* This oscillator being enabled is a precondition for various other features
*   in the CPLD, so we keep track of the state in this class.
*
* @param  on  Should the osciallator be enabled?
*/
void CPLDDriver::externalOscillator(bool on) {
  _er_set_flag(CPLD_FLAG_EXT_OSC, on);
  if (on) {
    HAL_TIM_OC_Start(&htim1, TIM_CHANNEL_1);
  }
  else {
    HAL_TIM_OC_Stop(&htim1, TIM_CHANNEL_1);
  }
}



/*******************************************************************************
* ___     _                                  This is a template class for
*  |   / / \ o    /\   _|  _. ._ _|_  _  ._  defining arbitrary I/O adapters.
* _|_ /  \_/ o   /--\ (_| (_| |_) |_ (/_ |   Adapters must be instanced with
*                             |              a BusOp as the template param.
*******************************************************************************/

int8_t CPLDDriver::bus_init() {
  init_spi(1, 0);   // CPOL=1, CPHA=0, HW-driven
  return 0;
}

int8_t CPLDDriver::bus_deinit() {
  return 0;
}

/**
* Debug support method. This fxn is only present in debug builds.
*
* @param   StringBuilder* The buffer into which this fxn should write its output.
*/
void CPLDDriver::printHardwareState(StringBuilder *output) {
  output->concatf("-- SPI1 (%sline) --------------------\n", (_er_flag(CPLD_FLAG_SPI1_READY)?"on":"OFF"));
  output->concatf("-- hspi1.State:        0x%08x\n", (unsigned long) hspi1.State);
  if (hspi2.ErrorCode) {
    output->concatf("-- hspi1.ErrorCode:    0x%08x\n", (unsigned long) hspi1.ErrorCode);
  }
  output->concatf("-- hspi1.RxXferCount:  0x%04x\n", hspi1.RxXferCount);
  output->concatf("-- hspi1.TxXferCount:  0x%04x\n", hspi1.TxXferCount);
  output->concatf("-- __hack_buffer       0x%08x\n--\n", __hack_buffer);
  output->concatf("-- _dma_r State      0x%04x\n", _dma_r.State);
  output->concatf("-- _dma_r->CR        0x%08x\n", DMA2_Stream2->CR);
  output->concatf("-- _dma_r->FCR       0x%08x\n", DMA2_Stream2->FCR);
  output->concatf("-- _dma_r->NDTR      0x%08x\n", DMA2_Stream2->NDTR);
}


