Manuvr/Digitabulum-Firmware/src/Digitabulum/CPLDDriver/target_stm32f746.cpp
/*******************************************************************************
* ___     _                              These members are mandatory overrides
*  |   / / \ o     |  _  |_              from the BusOp class.
* _|_ /  \_/ o   \_| (_) |_)
*******************************************************************************/

// Useful trick to mask warnings that the compiler raises, but which we know are
//   intentional.
//   http://stackoverflow.com/questions/3378560/how-to-disable-gcc-warnings-for-a-few-lines-of-code
//   https://gcc.gnu.org/onlinedocs/gcc/Diagnostic-Pragmas.html
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-but-set-variable"

/**
* Calling this member will cause the bus operation to be started.
*
* @return 0 on success, or non-zero on failure.
*/
XferFault SPIBusOp::begin() {
  //time_began    = micros();
  if (0 == _param_len) {
    // Obvious invalidity. We must have at least one transfer parameter.
    abort(XferFault::BAD_PARAM);
    return XferFault::BAD_PARAM;
  }

  if ((nullptr == buf) && (buf_len > 0)) {
    // Obvious invalidity. This condition is in conflict.
    abort(XferFault::BAD_PARAM);
    return XferFault::BAD_PARAM;
  }

  if (SPI1->SR & SPI_FLAG_BSY) {
    Kernel::log("SPI op aborted before taking bus control.\n");
    abort(XferFault::BUS_BUSY);
    return XferFault::BUS_BUSY;
  }

  set_state(XferState::INITIATE);  // Indicate that we now have bus control.

  if (2 >= _param_len) {
    // This is a CPLS register, and we are going to cheat a little by skipping
    //   the ADDR phase of the transfer.
    set_state((opcode == BusOpcode::TX) ? XferState::TX_WAIT : XferState::RX_WAIT);
    HAL_SPI_TransmitReceive_IT(&hspi1, (uint8_t*) xfer_params, (uint8_t*)(xfer_params + 2), _param_len);
  }
  else {
    // This is IMU-bound. It will have 4 transfer parameters, and we don't care
    //   about the return data. It therefore doesn't matter if RX or TX yet.
    set_state(XferState::ADDR);
    HAL_SPI_TransmitReceive_IT(&hspi1, (uint8_t*) xfer_params, (uint8_t*) &STATIC_SINK, _param_len);
  }

  _assert_cs(true);
  return XferFault::NONE;
}


/**
* Called from the ISR to advance this operation on the bus.
* Stay brief. We are in an ISR.
*
* @return 0 on success. Non-zero on failure.
*/
int8_t SPIBusOp::advance_operation(uint32_t status_reg, uint8_t data_reg) {
  StringBuilder debug_log;
  debug_log.concatf("advance_op(0x%08x, 0x%02x)\n\t %s\n\t status: 0x%08x\n", status_reg, data_reg, getStateString(), (unsigned long) hspi1.State);
  printDebug(&debug_log);
  Kernel::log(&debug_log);

  /* These are our transfer-size-invariant cases. */
  switch (xfer_state) {
    case XferState::COMPLETE:
      abort(XferFault::HUNG_IRQ);
      return 0;

    case XferState::TX_WAIT:
    case XferState::RX_WAIT:
      markComplete();
      return 0;

    case XferState::ADDR:
      if (buf_len > 0) {
        // We have 4 bytes to throw away from the params transfer.
        //uint16_t tmpreg = hspi1.Instance->DR;
        //tmpreg = hspi1.Instance->DR;
        if (opcode == BusOpcode::TX) {
          set_state(XferState::TX_WAIT);
          HAL_SPI_Transmit_IT(&hspi1, (uint8_t*) buf, buf_len);
        }
        else {
          set_state(XferState::RX_WAIT);
          HAL_SPI_Receive_DMA(&hspi1, buf, buf_len);
          //enableSPI_DMA(true);
          //HAL_NVIC_DisableIRQ(SPI1_IRQn);
          //HAL_DMA_Init(&_dma_r);
          //_dma_r.State = HAL_DMA_STATE_BUSY;
          //__HAL_DMA_DISABLE(&_dma_r);
          //DMA2_Stream2->PAR   = (uint32_t) &hspi1.Instance->DR;
          //DMA2_Stream2->M0AR  = (uint32_t) buf;
          //DMA2_Stream2->NDTR  = buf_len;
          //DMA2_Stream2->CR   &= ~((uint32_t) (DMA_SxCR_DBM | DMA_SxCR_CT));
          //DMA2_Stream2->CR   |= (uint32_t) (DMA_IT_TC | DMA_IT_TE | DMA_IT_DME);
          //DMA2_Stream2->FCR  |= (uint32_t) DMA_IT_FE;
          //__HAL_DMA_ENABLE(&_dma_r);
          //__HAL_SPI_ENABLE(&hspi1);
        }
      }
      return 0;

    case XferState::STOP:
    case XferState::UNDEF:
    case XferState::FAULT:
      abort(XferFault::ILLEGAL_STATE);
      return 0;

    case XferState::QUEUED:
    case XferState::INITIATE:
    case XferState::IDLE:
      abort(XferFault::ILLEGAL_STATE);
      return 0;
  }
  return -1;
}
#pragma GCC diagnostic pop
